        01  CALLOUTREQUEST.
            10  CALLOUTREQUESTSTR  PIC X(40).
            10  CALLOUTORDERNUM    PIC S9(9) COMP-5.
            10  CALLOUTDATE        PIC X(10). 
            
        01  CALLOUTRESPONSE.
            10  CALLOUTRESPONSESTR  PIC X(40).
            10  CALLOUTORDERNUM     PIC S9(9) COMP-5.
            10  CALLOUTDATE         PIC X(10).             